TestPlans/Car/Sure Thing! Max/xml/STM3_15102014_5.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <tns:aggregateQuoteRequest xmlns:tns="http://schemas.cdlis.co.uk/aggregator/api/v3-8">
      <userid>CTM</userid>
      <password>tys82HS63BjS</password>
      <broker results="1">hastings-dir</broker>
      <broker results="1">hastings-ess</broker>
      <broker results="1">igi3</broker>
      <broker results="1">onequote</broker>
      <broker results="1">elite</broker>
      <broker results="1">virgin</broker>
      <broker results="1">esurebroker</broker>
      <broker results="1">sheilasbroker</broker>
      <broker results="1">hastings-prem</broker>
      <broker results="1">hastings-peoples</broker>
      <broker results="1">selecter-oyd</broker>
      <broker results="1">sagaselect</broker>
      <broker results="1">smartmiles</broker>
      <broker results="1">castlecover-ageas50</broker>
      <broker results="1">surething</broker>
      <broker results="1">igo4asp-santander</broker>
      <broker results="1">igo4asp-renault</broker>
      <broker results="1">insurewiser</broker>
      <broker results="1">coverbox</broker>
      <broker results="1">drivestyle</broker>
      <broker results="1">sheilaswheelsmd</broker>
      <broker results="1">SureThing-Max</broker>
      <policyType>PC</policyType>
      <returnNoQuotes>Y</returnNoQuotes>
      <store>true</store>
      <risk xsi:type="tns:privateCarRiskType">
        <policy>
          <inceptionDate>2014-10-18</inceptionDate>
          <frequency>A</frequency>
          <protectedBonus>N</protectedBonus>
          <cover>C</cover>
          <volXS>600</volXS>
          <restrict>ND</restrict>
          <previousInsurance>
            <expiryDate>2014-10-18</expiryDate>
            <yearsHeld>0</yearsHeld>
            <type>PC</type>
            <noClaimsBonusYears>1</noClaimsBonusYears>
            <ncbProtected>N</ncbProtected>
          </previousInsurance>
          <totalMileage>7000</totalMileage>
          <businessMileage>5000</businessMileage>
          <classOfUse>JC1</classOfUse>
        </policy>
        <proposer driverId="1">
          <name>
            <title>Dr</title>
            <forenames>Edward</forenames>
            <surname>Five</surname>
          </name>
          <gender>M</gender>
          <dateOfBirth>1977-05-05</dateOfBirth>
          <maritalStatus>M</maritalStatus>
          <residentSince>1977-05-05</residentSince>
          <insuranceRefused>N</insuranceRefused>
          <nonRtaConviction>Y</nonRtaConviction>
          <fullTimeOccupation>
            <type>E</type>
            <occCode>653</occCode>
            <empCode>323</empCode>
          </fullTimeOccupation>
          <claim claimId="1">
            <code>M102</code>
            <date>2012-01-01</date>
            <cost>3000.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>Y</fault>
            <personalInjury>Y</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>P</type>
            <date>2010-10-15</date>
          </licence>
          <tests>0</tests>
          <vehicleUse>M</vehicleUse>
          <accessToOtherVehicles>CC</accessToOtherVehicles>
          <motoringOrg>NONE</motoringOrg>
          <smoker>Y</smoker>
          <address>
            <addressLine1>174 Partington Lane</addressLine1>
            <addressLine2>Swinton</addressLine2>
            <addressLine3>Manchester</addressLine3>
            <addressLine4></addressLine4>
            <postCode>M27 0WN</postCode>
            <abodeType>H</abodeType>
          </address>
          <daytimeTelephone>01733320301</daytimeTelephone>
          <eveningTelephone>01733320301</eveningTelephone>
          <email>oliver.neal@emailreaction.org</email>
        </proposer>
        <driver driverId="2">
          <name>
            <title>Mr</title>
            <forenames>Adam</forenames>
            <surname>One</surname>
          </name>
          <gender>M</gender>
          <dateOfBirth>1976-06-04</dateOfBirth>
          <maritalStatus>M</maritalStatus>
          <residentSince>1976-06-04</residentSince>
          <insuranceRefused>N</insuranceRefused>
          <nonRtaConviction>N</nonRtaConviction>
          <fullTimeOccupation>
            <type>E</type>
            <occCode>03A</occCode>
            <empCode>726</empCode>
          </fullTimeOccupation>
          <claim claimId="2">
            <code>C003</code>
            <date>2011-08-01</date>
            <cost>0.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>Y</fault>
            <personalInjury>N</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>F</type>
            <date>1994-10-15</date>
          </licence>
          <vehicleUse>F</vehicleUse>
          <accessToOtherVehicles>OOC</accessToOtherVehicles>
          <relationshipToProposer>S</relationshipToProposer>
        </driver>
        <driver driverId="3">
          <name>
            <title>Miss</title>
            <forenames>Esme</forenames>
            <surname>Five</surname>
          </name>
          <gender>F</gender>
          <dateOfBirth>1980-10-08</dateOfBirth>
          <maritalStatus>D</maritalStatus>
          <residentSince>1980-10-08</residentSince>
          <insuranceRefused>N</insuranceRefused>
          <nonRtaConviction>N</nonRtaConviction>
          <fullTimeOccupation>
            <type>R</type>
            <occCode>R09</occCode>
            <empCode>186</empCode>
          </fullTimeOccupation>
          <claim claimId="3">
            <code>F001</code>
            <date>2011-12-01</date>
            <cost>0.00</cost>
            <thirdPartyCost>0</thirdPartyCost>
            <fault>Y</fault>
            <personalInjury>N</personalInjury>
            <thisPolicy>N</thisPolicy>
          </claim>
          <licence>
            <type>E</type>
            <date>2007-10-15</date>
          </licence>
          <vehicleUse>F</vehicleUse>
          <accessToOtherVehicles>NAOV</accessToOtherVehicles>
          <relationshipToProposer>P</relationshipToProposer>
        </driver>
        <vehicle>
          <regNumber>X779NBM</regNumber>
          <abiCode>52011702</abiCode>
          <yearOfManufacture>2000</yearOfManufacture>
          <whereKept>R</whereKept>
          <keeper>N</keeper>
          <owner>Spouse</owner>
          <purchased>2007-10-01</purchased>
          <value>2345</value>
          <paid>2345</paid>
          <vehicleOthers>7</vehicleOthers>
          <LHD>N</LHD>
          <ABS>N</ABS>
          <seats>5</seats>
          <modifications>
            <modified>N</modified>
          </modifications>
          <immob>FACT</immob>
          <alarm>FACT</alarm>
          <tracker>NONE</tracker>
        </vehicle>
        <duqs>
          <question number="11">N</question>
          <question number="15">Y</question>
          <question number="190">2010</question>
          <question number="266">A</question>
          <question number="40">STRT</question>
          <question number="579" />
          <question number="580"></question>
          <question number="578">N</question>
          <question number="282">F</question>
          <question number="527">N</question>
          <question number="675">N</question>
          <question number="544">Y</question>
        </duqs>
      </risk>
      <brokerOptionalExtensions>
        <brokerOptionalExtension>
          <type>Premier Mandatory Bundle</type>
        </brokerOptionalExtension>
      </brokerOptionalExtensions>
    </tns:aggregateQuoteRequest>
  </soap:Body>
</soap:Envelope>